RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_sysctl_regs.h
/*
 * HALT (RW)
 *
 * halt request for CPU0,
 * 0: CPU0 will start to execute after reset or receive wakeup request
 * 1: CPU0 will not start after reset, or wakeup after WFI
 */
#define SYSCTL_CPU_LP_HALT_MASK (0x10000UL)
#define SYSCTL_CPU_LP_HALT_SHIFT (16U)
#define SYSCTL_CPU_LP_HALT_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_HALT_SHIFT) & SYSCTL_CPU_LP_HALT_MASK)
#define SYSCTL_CPU_LP_HALT_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_HALT_MASK) >> SYSCTL_CPU_LP_HALT_SHIFT)

/*
 * WAKE (RO)
 *
 * CPU0 is waking up
 * 0: CPU0 wake up not asserted
 * 1: CPU0 wake up asserted
 */
#define SYSCTL_CPU_LP_WAKE_MASK (0x2000U)
#define SYSCTL_CPU_LP_WAKE_SHIFT (13U)
#define SYSCTL_CPU_LP_WAKE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_WAKE_MASK) >> SYSCTL_CPU_LP_WAKE_SHIFT)

/*
 * EXEC (RO)
 *
 * CPU0 is executing
 * 0: CPU0 is not executing
 * 1: CPU0 is executing
 */
#define SYSCTL_CPU_LP_EXEC_MASK (0x1000U)
#define SYSCTL_CPU_LP_EXEC_SHIFT (12U)
#define SYSCTL_CPU_LP_EXEC_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_EXEC_MASK) >> SYSCTL_CPU_LP_EXEC_SHIFT)

/*
 * WAKE_FLAG (RW)
 *
 * CPU0 wakeup flag, indicate a wakeup event got active, write 1 to clear this bit
 * 0: CPU0 wakeup not happened
 * 1: CPU0 wake up happened
 */
#define SYSCTL_CPU_LP_WAKE_FLAG_MASK (0x400U)
#define SYSCTL_CPU_LP_WAKE_FLAG_SHIFT (10U)
#define SYSCTL_CPU_LP_WAKE_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_WAKE_FLAG_SHIFT) & SYSCTL_CPU_LP_WAKE_FLAG_MASK)
#define SYSCTL_CPU_LP_WAKE_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_WAKE_FLAG_MASK) >> SYSCTL_CPU_LP_WAKE_FLAG_SHIFT)

/*
 * SLEEP_FLAG (RW)
 *
 * CPU0 sleep flag, indicate a sleep event got active, write 1 to clear this bit
 * 0: CPU0 sleep not happened
 * 1: CPU0 sleep happened
 */
#define SYSCTL_CPU_LP_SLEEP_FLAG_MASK (0x200U)
#define SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT (9U)
#define SYSCTL_CPU_LP_SLEEP_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT) & SYSCTL_CPU_LP_SLEEP_FLAG_MASK)
#define SYSCTL_CPU_LP_SLEEP_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_SLEEP_FLAG_MASK) >> SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT)

/*
 * RESET_FLAG (RW)
 *
 * CPU0 reset flag, indicate a reset event got active, write 1 to clear this bit
 * 0: CPU0 reset not happened
 * 1: CPU0 reset happened
 */
#define SYSCTL_CPU_LP_RESET_FLAG_MASK (0x100U)
#define SYSCTL_CPU_LP_RESET_FLAG_SHIFT (8U)
#define SYSCTL_CPU_LP_RESET_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_RESET_FLAG_SHIFT) & SYSCTL_CPU_LP_RESET_FLAG_MASK)
#define SYSCTL_CPU_LP_RESET_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_RESET_FLAG_MASK) >> SYSCTL_CPU_LP_RESET_FLAG_SHIFT)

/*
 * MODE (RW)
 *
 * Low power mode, system behavior after WFI
 * 00: CPU clock stop after WFI
 * 01: System enter low power mode after WFI
 * 10: Keep running after WFI
 * 11: reserved
 */
#define SYSCTL_CPU_LP_MODE_MASK (0x3U)
#define SYSCTL_CPU_LP_MODE_SHIFT (0U)
#define SYSCTL_CPU_LP_MODE_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_MODE_SHIFT) & SYSCTL_CPU_LP_MODE_MASK)
#define SYSCTL_CPU_LP_MODE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_MODE_MASK) >> SYSCTL_CPU_LP_MODE_SHIFT)

/* Bitfield definition for register of struct array CPU: LOCK */
/*
 * GPR (RW)
 *
 * Lock bit for CPU_DATA0 to CPU_DATA13, once set, this bit will not clear untile next reset
 */
#define SYSCTL_CPU_LOCK_GPR_MASK (0xFFFCU)
#define SYSCTL_CPU_LOCK_GPR_SHIFT (2U)
#define SYSCTL_CPU_LOCK_GPR_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LOCK_GPR_SHIFT) & SYSCTL_CPU_LOCK_GPR_MASK)
#define SYSCTL_CPU_LOCK_GPR_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LOCK_GPR_MASK) >> SYSCTL_CPU_LOCK_GPR_SHIFT)

/*
 * LOCK (RW)
 *
 * Lock bit for CPU_LOCK
 */
#define SYSCTL_CPU_LOCK_LOCK_MASK (0x2U)
#define SYSCTL_CPU_LOCK_LOCK_SHIFT (1U)
#define SYSCTL_CPU_LOCK_LOCK_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LOCK_LOCK_SHIFT) & SYSCTL_CPU_LOCK_LOCK_MASK)
#define SYSCTL_CPU_LOCK_LOCK_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LOCK_LOCK_MASK) >> SYSCTL_CPU_LOCK_LOCK_SHIFT)

/* Bitfield definition for register of struct array CPU: GPR0 */
/*
 * GPR (RW)
 *
 * register for software to handle resume, can save resume address or status
 */
#define SYSCTL_CPU_GPR_GPR_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_GPR_GPR_SHIFT (0U)
#define SYSCTL_CPU_GPR_GPR_SET(x) (((uint32_t)(x) << SYSCTL_CPU_GPR_GPR_SHIFT) & SYSCTL_CPU_GPR_GPR_MASK)
#define SYSCTL_CPU_GPR_GPR_GET(x) (((uint32_t)(x) & SYSCTL_CPU_GPR_GPR_MASK) >> SYSCTL_CPU_GPR_GPR_SHIFT)

/* Bitfield definition for register of struct array CPU: STATUS0 */
/*
 * STATUS (RO)
 *
 * IRQ values
 */
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_SHIFT (0U)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_GET(x) (((uint32_t)(x) & SYSCTL_CPU_WAKEUP_STATUS_STATUS_MASK) >> SYSCTL_CPU_WAKEUP_STATUS_STATUS_SHIFT)

/* Bitfield definition for register of struct array CPU: ENABLE0 */
/*
 * ENABLE (RW)
 *
 * IRQ wakeup enable
 */
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT (0U)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SET(x) (((uint32_t)(x) << SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT) & SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK) >> SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT)



/* RESOURCE register group index macro definition */
#define SYSCTL_RESOURCE_CPU0 (0UL)
#define SYSCTL_RESOURCE_CPX0 (1UL)
#define SYSCTL_RESOURCE_CPU1 (8UL)
#define SYSCTL_RESOURCE_CPX1 (9UL)
#define SYSCTL_RESOURCE_POW_CPU0 (21UL)
#define SYSCTL_RESOURCE_POW_CPU1 (22UL)
#define SYSCTL_RESOURCE_POW_OTN (23UL)
#define SYSCTL_RESOURCE_RST_SOC (24UL)
#define SYSCTL_RESOURCE_RST_CPU0 (25UL)
#define SYSCTL_RESOURCE_RST_CPU1 (26UL)
#define SYSCTL_RESOURCE_RST_OTN (27UL)
#define SYSCTL_RESOURCE_CLK_SRC_XTAL (32UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0 (33UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL0 (34UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL0 (35UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1 (36UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL1 (37UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL1 (38UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK2_PLL1 (39UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2 (40UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL2 (41UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL2 (42UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0_REF (43UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1_REF (44UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2_REF (45UL)
#define SYSCTL_RESOURCE_CLK_TOP_CPU0 (64UL)
#define SYSCTL_RESOURCE_CLK_TOP_MCT0 (65UL)
#define SYSCTL_RESOURCE_CLK_TOP_CPU1 (66UL)
#define SYSCTL_RESOURCE_CLK_TOP_MCT1 (67UL)
#define SYSCTL_RESOURCE_CLK_TOP_AHB0 (68UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXIF (69UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXIS (70UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXIC (71UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXIN (72UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR0 (73UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR1 (74UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR2 (75UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR3 (76UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR4 (77UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR5 (78UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR6 (79UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR7 (80UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C0 (81UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C1 (82UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C2 (83UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C3 (84UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C4 (85UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C5 (86UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C6 (87UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C7 (88UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI0 (89UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI1 (90UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI2 (91UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI3 (92UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI4 (93UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI5 (94UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI6 (95UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI7 (96UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT0 (97UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT1 (98UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT2 (99UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT3 (100UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT4 (101UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT5 (102UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT6 (103UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT7 (104UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT8 (105UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT9 (106UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT10 (107UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT11 (108UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT12 (109UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT13 (110UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT14 (111UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT15 (112UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA0 (113UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA1 (114UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA2 (115UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA3 (116UL)
#define SYSCTL_RESOURCE_CLK_TOP_AUD0 (117UL)
#define SYSCTL_RESOURCE_CLK_TOP_AUD1 (118UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN0 (119UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN1 (120UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN2 (121UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN3 (122UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN4 (123UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN5 (124UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN6 (125UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN7 (126UL)
#define SYSCTL_RESOURCE_CLK_TOP_XPI0 (127UL)
#define SYSCTL_RESOURCE_CLK_TOP_FEMC (128UL)
#define SYSCTL_RESOURCE_CLK_TOP_ETH0 (129UL)
#define SYSCTL_RESOURCE_CLK_TOP_PTP0 (130UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF0 (131UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF1 (132UL)
#define SYSCTL_RESOURCE_CLK_TOP_NTM0 (133UL)
#define SYSCTL_RESOURCE_CLK_TOP_TSW1 (134UL)
#define SYSCTL_RESOURCE_CLK_TOP_TSW2 (135UL)
#define SYSCTL_RESOURCE_CLK_TOP_TSW3 (136UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC0 (137UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC1 (138UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC2 (139UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC3 (140UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2S0 (141UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2S1 (142UL)
#define SYSCTL_RESOURCE_AHBP (256UL)
#define SYSCTL_RESOURCE_AXIS (257UL)
#define SYSCTL_RESOURCE_AXIC (258UL)
#define SYSCTL_RESOURCE_AXIN (259UL)
#define SYSCTL_RESOURCE_ROM0 (260UL)
#define SYSCTL_RESOURCE_LMM0 (261UL)
#define SYSCTL_RESOURCE_MCT0 (262UL)
#define SYSCTL_RESOURCE_LMM1 (263UL)
#define SYSCTL_RESOURCE_MCT1 (264UL)
#define SYSCTL_RESOURCE_TMR0 (265UL)
#define SYSCTL_RESOURCE_TMR1 (266UL)
#define SYSCTL_RESOURCE_TMR2 (267UL)
#define SYSCTL_RESOURCE_TMR3 (268UL)
#define SYSCTL_RESOURCE_TMR4 (269UL)
#define SYSCTL_RESOURCE_TMR5 (270UL)
#define SYSCTL_RESOURCE_TMR6 (271UL)
#define SYSCTL_RESOURCE_TMR7 (272UL)
#define SYSCTL_RESOURCE_I2C0 (273UL)
#define SYSCTL_RESOURCE_I2C1 (274UL)
#define SYSCTL_RESOURCE_I2C2 (275UL)
#define SYSCTL_RESOURCE_I2C3 (276UL)
#define SYSCTL_RESOURCE_I2C4 (277UL)
#define SYSCTL_RESOURCE_I2C5 (278UL)
#define SYSCTL_RESOURCE_I2C6 (279UL)
#define SYSCTL_RESOURCE_I2C7 (280UL)
#define SYSCTL_RESOURCE_SPI0 (281UL)
#define SYSCTL_RESOURCE_SPI1 (282UL)
#define SYSCTL_RESOURCE_SPI2 (283UL)
#define SYSCTL_RESOURCE_SPI3 (284UL)
#define SYSCTL_RESOURCE_SPI4 (285UL)
#define SYSCTL_RESOURCE_SPI5 (286UL)
#define SYSCTL_RESOURCE_SPI6 (287UL)
#define SYSCTL_RESOURCE_SPI7 (288UL)
#define SYSCTL_RESOURCE_URT0 (289UL)
#define SYSCTL_RESOURCE_URT1 (290UL)
#define SYSCTL_RESOURCE_URT2 (291UL)
#define SYSCTL_RESOURCE_URT3 (292UL)
#define SYSCTL_RESOURCE_URT4 (293UL)
#define SYSCTL_RESOURCE_URT5 (294UL)
#define SYSCTL_RESOURCE_URT6 (295UL)
#define SYSCTL_RESOURCE_URT7 (296UL)
#define SYSCTL_RESOURCE_URT8 (297UL)
#define SYSCTL_RESOURCE_URT9 (298UL)
#define SYSCTL_RESOURCE_URT10 (299UL)
#define SYSCTL_RESOURCE_URT11 (300UL)
#define SYSCTL_RESOURCE_URT12 (301UL)
#define SYSCTL_RESOURCE_URT13 (302UL)
#define SYSCTL_RESOURCE_URT14 (303UL)
#define SYSCTL_RESOURCE_URT15 (304UL)
#define SYSCTL_RESOURCE_CRC0 (305UL)
#define SYSCTL_RESOURCE_TSNS (306UL)
#define SYSCTL_RESOURCE_WDG0 (307UL)
#define SYSCTL_RESOURCE_WDG1 (308UL)
#define SYSCTL_RESOURCE_WDG2 (309UL)
#define SYSCTL_RESOURCE_WDG3 (310UL)
#define SYSCTL_RESOURCE_MBX0 (311UL)
#define SYSCTL_RESOURCE_MBX1 (312UL)
#define SYSCTL_RESOURCE_GPIO (313UL)
#define SYSCTL_RESOURCE_PPI0 (314UL)
#define SYSCTL_RESOURCE_HDMA (315UL)
#define SYSCTL_RESOURCE_LOBS (316UL)
#define SYSCTL_RESOURCE_ADC0 (317UL)
#define SYSCTL_RESOURCE_ADC1 (318UL)
#define SYSCTL_RESOURCE_ADC2 (319UL)
#define SYSCTL_RESOURCE_ADC3 (320UL)
#define SYSCTL_RESOURCE_CMP0 (321UL)
#define SYSCTL_RESOURCE_CMP1 (322UL)
#define SYSCTL_RESOURCE_CMP2 (323UL)
#define SYSCTL_RESOURCE_CMP3 (324UL)
#define SYSCTL_RESOURCE_I2S0 (325UL)
#define SYSCTL_RESOURCE_I2S1 (326UL)
#define SYSCTL_RESOURCE_PDM0 (327UL)
#define SYSCTL_RESOURCE_CLSD (328UL)
#define SYSCTL_RESOURCE_CAN0 (329UL)
#define SYSCTL_RESOURCE_CAN1 (330UL)
#define SYSCTL_RESOURCE_CAN2 (331UL)
#define SYSCTL_RESOURCE_CAN3 (332UL)
#define SYSCTL_RESOURCE_CAN4 (333UL)
#define SYSCTL_RESOURCE_CAN5 (334UL)
#define SYSCTL_RESOURCE_CAN6 (335UL)
#define SYSCTL_RESOURCE_CAN7 (336UL)
#define SYSCTL_RESOURCE_PTPC (337UL)
#define SYSCTL_RESOURCE_QEI0 (338UL)
#define SYSCTL_RESOURCE_QEI1 (339UL)
#define SYSCTL_RESOURCE_QEI2 (340UL)
#define SYSCTL_RESOURCE_QEI3 (341UL)
#define SYSCTL_RESOURCE_QEO0 (342UL)
#define SYSCTL_RESOURCE_QEO1 (343UL)
#define SYSCTL_RESOURCE_QEO2 (344UL)
#define SYSCTL_RESOURCE_QEO3 (345UL)
#define SYSCTL_RESOURCE_PWM0 (346UL)
#define SYSCTL_RESOURCE_PWM1 (347UL)
#define SYSCTL_RESOURCE_PWM2 (348UL)
#define SYSCTL_RESOURCE_PWM3 (349UL)
#define SYSCTL_RESOURCE_RDC0 (350UL)
#define SYSCTL_RESOURCE_RDC1 (351UL)
#define SYSCTL_RESOURCE_SDM0 (352UL)
#define SYSCTL_RESOURCE_SDM1 (353UL)
#define SYSCTL_RESOURCE_PLB0 (354UL)
#define SYSCTL_RESOURCE_SEI0 (355UL)
#define SYSCTL_RESOURCE_MTG0 (356UL)
#define SYSCTL_RESOURCE_MTG1 (357UL)
#define SYSCTL_RESOURCE_VSC0 (358UL)
#define SYSCTL_RESOURCE_VSC1 (359UL)
#define SYSCTL_RESOURCE_CLC0 (360UL)
#define SYSCTL_RESOURCE_CLC1 (361UL)
#define SYSCTL_RESOURCE_EMDS (362UL)
#define SYSCTL_RESOURCE_RNG0 (363UL)
#define SYSCTL_RESOURCE_SDP0 (364UL)
#define SYSCTL_RESOURCE_PKA0 (365UL)
#define SYSCTL_RESOURCE_KMAN (366UL)
#define SYSCTL_RESOURCE_XPI0 (367UL)
#define SYSCTL_RESOURCE_FEMC (368UL)
#define SYSCTL_RESOURCE_RAM0 (369UL)
#define SYSCTL_RESOURCE_RAM1 (370UL)
#define SYSCTL_RESOURCE_XDMA (371UL)
#define SYSCTL_RESOURCE_FFA0 (372UL)
#define SYSCTL_RESOURCE_ETH0 (373UL)
#define SYSCTL_RESOURCE_USB0 (374UL)
#define SYSCTL_RESOURCE_NTM0 (375UL)
#define SYSCTL_RESOURCE_REF0 (376UL)
#define SYSCTL_RESOURCE_REF1 (377UL)
#define SYSCTL_RESOURCE_TSW0 (378UL)
#define SYSCTL_RESOURCE_ESC0 (379UL)

/* GROUP0 register group index macro definition */
#define SYSCTL_GROUP0_LINK0 (0UL)
#define SYSCTL_GROUP0_LINK1 (1UL)
#define SYSCTL_GROUP0_LINK2 (2UL)
#define SYSCTL_GROUP0_LINK3 (3UL)

/* GROUP1 register group index macro definition */
#define SYSCTL_GROUP1_LINK0 (0UL)
#define SYSCTL_GROUP1_LINK1 (1UL)
#define SYSCTL_GROUP1_LINK2 (2UL)
#define SYSCTL_GROUP1_LINK3 (3UL)

/* AFFILIATE register group index macro definition */
#define SYSCTL_AFFILIATE_CPU0 (0UL)
#define SYSCTL_AFFILIATE_CPU1 (1UL)

