RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_sysctl_regs.h
/* RETENTION register group index macro definition */
#define SYSCTL_RETENTION_CPU0 (0UL)
#define SYSCTL_RETENTION_CPU1 (1UL)

/* POWER register group index macro definition */
#define SYSCTL_POWER_CPU0 (0UL)
#define SYSCTL_POWER_CPU1 (1UL)
#define SYSCTL_POWER_OTN (2UL)

/* RESET register group index macro definition */
#define SYSCTL_RESET_SOC (0UL)
#define SYSCTL_RESET_CPU0 (1UL)
#define SYSCTL_RESET_CPU1 (2UL)
#define SYSCTL_RESET_OTN (3UL)

/* CLOCK register group index macro definition */
#define SYSCTL_CLOCK_CLK_TOP_CPU0 (0UL)
#define SYSCTL_CLOCK_CLK_TOP_MCT0 (1UL)
#define SYSCTL_CLOCK_CLK_TOP_CPU1 (2UL)
#define SYSCTL_CLOCK_CLK_TOP_MCT1 (3UL)
#define SYSCTL_CLOCK_CLK_TOP_AHB0 (4UL)
#define SYSCTL_CLOCK_CLK_TOP_AXIF (5UL)
#define SYSCTL_CLOCK_CLK_TOP_AXIS (6UL)
#define SYSCTL_CLOCK_CLK_TOP_AXIC (7UL)
#define SYSCTL_CLOCK_CLK_TOP_AXIN (8UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR0 (9UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR1 (10UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR2 (11UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR3 (12UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR4 (13UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR5 (14UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR6 (15UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR7 (16UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C0 (17UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C1 (18UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C2 (19UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C3 (20UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C4 (21UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C5 (22UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C6 (23UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C7 (24UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI0 (25UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI1 (26UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI2 (27UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI3 (28UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI4 (29UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI5 (30UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI6 (31UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI7 (32UL)
#define SYSCTL_CLOCK_CLK_TOP_URT0 (33UL)
#define SYSCTL_CLOCK_CLK_TOP_URT1 (34UL)
#define SYSCTL_CLOCK_CLK_TOP_URT2 (35UL)
#define SYSCTL_CLOCK_CLK_TOP_URT3 (36UL)
#define SYSCTL_CLOCK_CLK_TOP_URT4 (37UL)
#define SYSCTL_CLOCK_CLK_TOP_URT5 (38UL)
#define SYSCTL_CLOCK_CLK_TOP_URT6 (39UL)
#define SYSCTL_CLOCK_CLK_TOP_URT7 (40UL)
#define SYSCTL_CLOCK_CLK_TOP_URT8 (41UL)
#define SYSCTL_CLOCK_CLK_TOP_URT9 (42UL)
#define SYSCTL_CLOCK_CLK_TOP_URT10 (43UL)
#define SYSCTL_CLOCK_CLK_TOP_URT11 (44UL)
#define SYSCTL_CLOCK_CLK_TOP_URT12 (45UL)
#define SYSCTL_CLOCK_CLK_TOP_URT13 (46UL)
#define SYSCTL_CLOCK_CLK_TOP_URT14 (47UL)
#define SYSCTL_CLOCK_CLK_TOP_URT15 (48UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA0 (49UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA1 (50UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA2 (51UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA3 (52UL)
#define SYSCTL_CLOCK_CLK_TOP_AUD0 (53UL)
#define SYSCTL_CLOCK_CLK_TOP_AUD1 (54UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN0 (55UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN1 (56UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN2 (57UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN3 (58UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN4 (59UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN5 (60UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN6 (61UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN7 (62UL)
#define SYSCTL_CLOCK_CLK_TOP_XPI0 (63UL)
#define SYSCTL_CLOCK_CLK_TOP_FEMC (64UL)
#define SYSCTL_CLOCK_CLK_TOP_ETH0 (65UL)
#define SYSCTL_CLOCK_CLK_TOP_PTP0 (66UL)
#define SYSCTL_CLOCK_CLK_TOP_NTM0 (67UL)
#define SYSCTL_CLOCK_CLK_TOP_REF0 (68UL)
#define SYSCTL_CLOCK_CLK_TOP_REF1 (69UL)
#define SYSCTL_CLOCK_CLK_TOP_TSW1 (70UL)
#define SYSCTL_CLOCK_CLK_TOP_TSW2 (71UL)
#define SYSCTL_CLOCK_CLK_TOP_TSW3 (72UL)

/* ADCCLK register group index macro definition */
#define SYSCTL_ADCCLK_CLK_TOP_ADC0 (0UL)
#define SYSCTL_ADCCLK_CLK_TOP_ADC1 (1UL)
#define SYSCTL_ADCCLK_CLK_TOP_ADC2 (2UL)
#define SYSCTL_ADCCLK_CLK_TOP_ADC3 (3UL)

/* I2SCLK register group index macro definition */
#define SYSCTL_I2SCLK_CLK_TOP_I2S0 (0UL)
#define SYSCTL_I2SCLK_CLK_TOP_I2S1 (1UL)

/* MONITOR register group index macro definition */
#define SYSCTL_MONITOR_SLICE0 (0UL)
#define SYSCTL_MONITOR_SLICE1 (1UL)
#define SYSCTL_MONITOR_SLICE2 (2UL)
#define SYSCTL_MONITOR_SLICE3 (3UL)

/* GPR register group index macro definition */
#define SYSCTL_CPU_GPR_GPR0 (0UL)
#define SYSCTL_CPU_GPR_GPR1 (1UL)
#define SYSCTL_CPU_GPR_GPR2 (2UL)
#define SYSCTL_CPU_GPR_GPR3 (3UL)
#define SYSCTL_CPU_GPR_GPR4 (4UL)
#define SYSCTL_CPU_GPR_GPR5 (5UL)
#define SYSCTL_CPU_GPR_GPR6 (6UL)
#define SYSCTL_CPU_GPR_GPR7 (7UL)
#define SYSCTL_CPU_GPR_GPR8 (8UL)
#define SYSCTL_CPU_GPR_GPR9 (9UL)
#define SYSCTL_CPU_GPR_GPR10 (10UL)
#define SYSCTL_CPU_GPR_GPR11 (11UL)
#define SYSCTL_CPU_GPR_GPR12 (12UL)
#define SYSCTL_CPU_GPR_GPR13 (13UL)

/* WAKEUP_STATUS register group index macro definition */
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS0 (0UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS1 (1UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS2 (2UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS3 (3UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS4 (4UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS5 (5UL)

/* WAKEUP_ENABLE register group index macro definition */
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE0 (0UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE1 (1UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE2 (2UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE3 (3UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE4 (4UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE5 (5UL)

/* CPU register group index macro definition */
#define SYSCTL_CPU_CPU0 (0UL)
#define SYSCTL_CPU_CPU1 (1UL)


#endif /* HPM_SYSCTL_H */
